[AdventTrooperArmor X2ArmorTemplate]
FriendlyName="ADVENT Trooper Armor"
FriendlyNamePlural="ADVENT Trooper Armors"
BriefSummary="The ADVENT Trooper forms the backbone of ADVENT's military power. Their main function is to police the Earth's human population. However, they may also be assigned to guard key assets alongside other enemy types. Troopers are ostensibly human, clad in this sleek, angular body armor."
TacticalText="<Bullet/>Soldiers may take advantage of scavenged ADVENT Trooper gear in combat. Additionally, we may catch our enemy off guard with this new armor."


[AdventTrooperArmorDetectionStat X2AbilityTemplate]
LocFriendlyName="Deception"
LocLongDescription="ADVENT will be less likely to detect this soldier during initial contact."
LocHelpText="ADVENT will be less likely to detect this soldier during initial contact."
LocFlyOverText="ADVENT will be less likely to detect this soldier during initial contact."
LocPromotionPopupText="<Bullet/> ADVENT will be less likely to detect this soldier during initial contact."